In [1]:
import pandas as pd
salaries = pd.read_csv('Salaries.csv')
salaries.head()

C:\Users\kevser\AppData\Local\Continuum\anaconda2\lib\site-packages\IPython\core\interactiveshell.py:2714: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411,0,400184,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966,245132,137811,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739,106088,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916,56120.7,198307,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134402,9737,182235,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [2]:

salaries.describe()

                  Id       TotalPay  TotalPayBenefits           Year  Notes
count  148654.000000  148654.000000     148654.000000  148654.000000    0.0
mean    74327.500000   74768.321972      93692.554811    2012.522643    NaN
std     42912.857795   50517.005274      62793.533483       1.117538    NaN
min         1.000000    -618.130000       -618.130000    2011.000000    NaN
25%     37164.250000   36168.995000      44065.650000    2012.000000    NaN
50%     74327.500000   71426.610000      92404.090000    2013.000000    NaN
75%    111490.750000  105839.135000     132876.450000    2014.000000    NaN
max    148654.000000  567595.430000     567595.430000    2014.000000    NaN

In [3]:
latest_salaries = salaries[salaries['Year'] == 2014]
latest_salaries.describe()

                  Id       TotalPay  TotalPayBenefits     Year  Notes
count   38123.000000   38123.000000      38123.000000  38123.0    0.0
mean   129593.000000   75463.918140     100250.918884   2014.0    NaN
std     11005.306493   51697.713029      66238.852887      0.0    NaN
min    110532.000000    -618.130000       -618.130000   2014.0    NaN
25%    120062.500000   33436.210000      44199.990000   2014.0    NaN
50%    129593.000000   72359.980000     101105.370000   2014.0    NaN
75%    139123.500000  107974.445000     142746.950000   2014.0    NaN
max    148654.000000  471952.640000     510732.680000   2014.0    NaN

In [4]:
average_yearly_rent = 3880 * 12
average_city_pay = latest_salaries['TotalPay'].mean()
average_yearly_rent / average_city_pay

0.6169836015336546

In [5]:
average_yearly_rent = 3880 * 12
average_city_pay = latest_salaries['TotalPay'].mean()
average_yearly_rent / average_city_pay

0.6169836015336546

In [6]:
latest_salaries[latest_salaries['TotalPay'] < average_yearly_rent].shape[0]

11360

In [7]:
pd.to_numeric(latest_salaries['BasePay'], errors='coerce').describe()

count     38119.000000
mean      66564.421924
std       44053.783972
min           0.000000
25%       30138.055000
50%       65055.000000
75%       94735.050000
max      318835.490000
Name: BasePay, dtype: float64

In [8]:
latest_salaries[latest_salaries['TotalPay'] < average_yearly_rent].shape[0]

11360

In [9]:
base_pay_series = pd.to_numeric(latest_salaries['BasePay'], errors='coerce')
base_pay_series[base_pay_series * .7 < average_yearly_rent].shape

(20074L,)

In [10]:
base_pay_series = pd.to_numeric(latest_salaries['BasePay'], errors='coerce')
base_pay_series[base_pay_series * .7 < average_yearly_rent].shape

(20074L,)

In [11]:
overtime_series = pd.to_numeric(latest_salaries['OvertimePay'], errors='coerce')
overtime_series.describe()
overtime_series[overtime_series > 1000].shape

(15361L,)